Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/checklists/checklist_when_applying_for_jobseeker_s_allowance_checklist.html.txt.tmx
Source language: en
Languages: ga

source: Checklist when applying for Jobseeker's Allowance
ga: Seicliosta nuair atá iarratas á dhéanamh ar Liúntas Cuardaitheora Poist

source: When you apply for Jobseeker’s Allowance you must bring certain documents with you
ga: Nuair a dhéantar iarratas ar Liúntas Cuardaitheora Poist, caithfidh tú doiciméid áirithe a thabhairt leat

source: If you lose your job or are made redundant
ga: Má chailltear post nó má dhéantar iomarcach tú

source: If you lose your job or are made redundant you should bring your P45 or a letter from your employer confirming the last day you worked
ga: Má chailltear post nó má dhéantar iomarcach tú, ba chóir duit do P45 nó litir ón bhfostóir a thabhairt leat a dhearbhaíonn an lá deiridh a d'oibrigh tú

source: If you don’t have your P45 or a letter from your employer you should still apply
ga: Mura bhfuil do P45 nó litir ón bhfostóir agat, ba chóir duit iarratas a dhéanamh mar sin féin

source: However, it is important to bring either your P45 or a letter from your employer as soon as possible to your Intreo Centre or local Social Welfare Branch Office
ga: Mar sin féin, tá sé tábhachtach do P45 nó litir ó d'fhostóir a thabhairt chuig an Ionad Intreo ó Oifig Leasa Shóisialaigh Áitiúil chomh luath agus is féidir

source: If you have difficulty getting your P45 from your employer tell the member of staff dealing with your claim at your Intreo Centre or local Social Welfare Branch Office (see ‘If you don’t have your P45’ below)
ga: Má tá deacracht agat ag fáil do P45 ón bhfostóir, inis do bhall foirne atá ag déileáil le d'éileamh san Oifig Leasa Shóisialaigh Áitiúil (féach ‘Mura bhfuil do P45 agat thíos)

source: If you are laid off
ga: Má dhéantar tú a leagan as

source: If you are laid off temporarily, you may or may not get a P45
ga: Má dhéantar tú a leagan as go sealadach, b'fhéidir go bhfaighfeá nó nach bhfaighfeá P45

source: If you don’t have a P45 you must bring a letter from your employer stating the following:
ga: Mura bhfuil P45 agat, caithfidh tú litir ón bhfostóir a thabhairt a thugann na sonraí a leanas:

source: • You have been laid off work without pay
ga: • Má dhéantar tú a leagan as gan phá

source: • The last day you worked
ga: • An lá deiridh a d'oibrigh tú

source: • The reason for the lay off
ga: • An chúis leis an leagan as

source: • How long he or she expects you will be laid off
ga: • Cé chomh fada a shíleann sé/sí a mhairfidh do leagan as

source: If your days of work are reduced
ga: Má dhéantar do laethanta oibre a laghdú

source: If your days of work are reduced you must bring a letter from your employer stating the following:
ga: Má laghdaítear do laethanta oibre, caithfidh tú litir a thabhairt ón bhfostóir a thugann na sonraí a leanas:

source: • Your days at work have been reduced on a temporary basis
ga: • Go bhfuil do laethanta oibre laghdaithe ar bhonn sealadach

source: • The number of days you worked each week
ga: • An líon laethanta a d'oibrigh tú gach seachtain

source: • The number of days you now work each week
ga: • An líon laethanta a oibríonn tú gach seachtain anois

source: • The reduction in your pay
ga: • An laghdú pá atá agat

source: You also need to bring the following documents or information:
ga: Caithfidh tú na doiciméid agus an t-eolas a leanas a thabhairt leat chomh maith:

source: • Your Public Services Card (if you don't have one you will be asked to register for one when applying for Jobseeker's Allowance)
ga: • Do Cárta Seirbhísí Poiblí

source: • Your Personal Public Service number
ga: • Do Uimhir Phearsanta Seirbhíse Poiblí

source: • Details of your availability for work and any efforts you have made to get work
ga: • Sonraí faoi d'infhaighteacht le haghaidh fostaíochta agus na hiarrachtaí atá déanta agat chun obair a fháil

source: For example, letters you have written to employers and any responses you have received
ga: Mar shampla, litreacha atá scríofa agat chuig fostóirí agus na freagraí a fuarthas

source: • Details of your spouse/partner's income (if any)
ga: • Sonraí ioncaim do chéile nó páirtí (mar is cuí)

source: • Details of your dependent children
ga: • Sonraí do leanaí cleithiúnacha

source: • Proof of your identity (see below for more information)
ga: • Cruthúnas céannachta (féach thíos chun tuilleadh eolais a fháil)

source: • Proof of address (see below for more information)
ga: • Cruthúnas seolta (féach thíos chun tuilleadh eolais a fháil)

source: You can provide evidence of your identity by showing your passport or your driver's licence
ga: Mura bhfuil pas nó ceadúnas tiomána agat, ba chóir duit aon doiciméad eile atá agat a thabhairt isteach, go háirithe ceann a bhfuil grianghraf díot air

source: If you do not have either a passport or driver’s licence, you should bring any other document that you may have, particularly one that has your photograph on it
ga: Is féidir do chéannacht a chruthú trí do phas nó ceadúnas tiomána a thaispeáint agus ceann ar bith de na nithe a leanas: • Aitheantas fótagrafach eile • Aoischárta • Cárta Leighis

source: The following documents may also be acceptable: credit card, debit card, medical card, age ID card, work ID card, club membership card
ga: Caithfidh tú sloinne breithe do mháthar a sholáthar chomh maith

source: The following items are not accepted as proof of identity:
ga: Níl na nithe a leanas inghlactha mar chruthúnas céannachta:

source: • Birth or Baptismal certificates
ga: • Leagan gearr de theastas breithe

source: A claim cannot be decided until identity has been proven
ga: Ní féidir cinneadh a dhéanamh faoi éileamh gan chruthúnas céannachta

source: You may be asked to show evidence of your address
ga: D'fhéadfaí iarraidh ort fianaise ar do sheoladh a thaispeáint

source: You should bring any of the following documents:
ga: Ba chóir duit ceann ar bith de na doiciméid seo a leanas a thabhairt isteach:

source: • Recent bills from utility companies such as electricity, telephone (landline or mobile), gas, cable television, waste charges etc
ga: • Billí le déanaí ó chuideachtaí fóntais cosúil le leictreachas, teileafón (líne talún nó fón póca), gás, teilifís chábla, táillí dramhaíola srl

source: • Recent statements/letters from banks, building societies, credit unions, credit card companies or other financial institutions
ga: • Ráitis/litreacha le déanaí ó bhainc, chumainn foirgníochta, chomhair chreidmheasa, chuideachtaí cárta creidmheasa nó institiúidí airgeadais eile

source: • Recent letters addressed to you from insurance companies, local authorities, government departments or the Revenue Commissioners
ga: • Litreacha a seoladh chugat le déanaí ó chuideachtaí árachais, údaráis áitiúla, ranna rialtais nó na Coimisinéirí Ioncaim

source: • Local authority rent book, mortgage or leasing agreement
ga: • Leabhar cíosa údaráis áitiúil, morgáiste nó comhaontú léasaithe

source: Note: a recent document is one issued within the last 2 months
ga: Tabhair faoi deara: is é atá i gceist le doiciméad le déanaí ná ceann a eisíodh le 2 mhí anuas

source: All documents must be originals, not photocopies
ga: Caithfidh na doiciméid go léir a bheith ina mbunchóipeanna, ní ghlacfar le fótachóipeanna

source: If there is doubt about your address, the Jobseeker's Allowance claim is not awarded for payment until your address is verified
ga: Má tá amhras ar bith faoin seoladh, ní íoctar an t-éileamh ar Liúntas Cuardaitheora Poist go dtí go ndéantar do sheoladh a fhíorú

source: If you don’t have your P45
ga: Mura bhfuil do P45 agat

source: If you don’t have your P45 you should still apply for your Jobseeker’s Allowance
ga: Ba chóir duit iarratas a dhéanamh ar íocaíocht cuardaitheora poist - fiú mura bhfuil do P45 agat

source: If you lose your job and your employer does not issue you with a P45, it may be because you have not been registered for PRSI by your employer
ga: Má chailleann tú do phost agus mura n-eisíonn d'fhostóir foirm P45 duit, d'fhéadfadh sé a bheith amhlaidh toisc nár chláraigh sé nó sí tú le haghaidh ÁSPC

source: It also could be that you have been registered but your employer has not paid the PRSI contributions which are due or has not paid the correct amount
ga: D'fhéadfadh sé gur cláraíodh tú ach nár íoc d'fhostóir na ranníocaíochtaí ÁSPC a bhí iníoctha nó nár íocadh an méid ceart

source: Under the Social Welfare (Consolidation) Act 1993 the employer is obliged to register all employees for PRSI
ga: Faoi réir An Acht Leasa Shóisialaigh (Comhdhlúthú), 1993 ní mór don fhostóir gach fostaí a chlárú chun críche ÁSPC

source: More information can be found about Paying social insurance
ga: Is féidir tuilleadh eolais a fháil faoi Dhualgas an fhostóra chun árachas sóisialta a íoc

source: Jobseeker’s payment without a P45
ga: Íocaíocht cuardaitheora poist gan P45

source: If your former employer refuses to give you a P45 you should still apply for Jobseeker’s Allowance
ga: Má dhiúltaíonn d'iarfhostóir P45 a thabhairt duit, ba chóir duit iarratas a dhéanamh fós ar íocaíocht cuardaitheora poist

source: If you do not have a P45, the Department may informally contact your employer when you apply for Jobseeker’s Allowance and ask him or her to send you a P45 to help process your claim
ga: Mura bhfuil P45 agat, is féidir leis an Roinn teagmháil neamhfhoirmiúil a dhéanamh le d'fhostóir nuair a dhéanann tú iarratas ar Shochar Cuardaitheora Poist nó Liúntas Cuardaitheora Poist agus iarraidh air nó uirthi P45 a sheoladh chugat chun d'éileamh a phróiseáil

source: If this hasn't resulted in your former employer giving you your P45, you can ask to fill in form IA49 at your Intreo Centre or Social Welfare Branch Office
ga: Mura dtugann sé nó sí P45 duit dá thoradh sin féadfaidh tú a iarraidh san Oifig Leasa Shóisialaigh áitiúil go gcomhlíonfá foirm IA49

source: Form IA49 is a declaration stating that you believe your former employer did not comply with social insurance regulations
ga: Is éard atá sa bhfoirm IA49 ná dearbhú go gcreideann tú nár chomhlíon d'iarfhostóir na rialacháin árachais shóisialta

source: As a result of your declaration, there will be an investigation into your employer's payment of PRSI
ga: Déanfar fiosrú ar na híocaíochtaí ÁSPC a rinne d'iarfhostóir de thoradh do dhearbhaithe

source: Filling in form IA49 may not result in your P45, however, it may help to determine if you qualify for Jobseeker's Allowance
ga: B'fhéidir nach bhfaighidh tú P45 de bharr IA49 a chomhlánú ach cabhróidh sé cinneadh a dhéanamh an bhfuil tú incháilithe don íocaíocht cuardaitheora poist

source: Other ways to get your P45
ga: Bealaí eile chun do P45 a fháil

source: If you are not given a P45 when you leave your job you should first ask your employer for it
ga: Mura dtugtar P45 duit nuair a fhágann tú do phost ba chóir duit a iarraidh ar d'fhostóir ar dtús í a thabhairt duit

source: If the employer does not supply it you should contact the tax office
ga: Mura gcuireann sé nó sí ar fáil í ba chóir duit dul i dteagmháil leis an oifig cánach

source: If you contact your tax office, Revenue will contact the employer and obtain your P45 for you
ga: Má théann tú i dteagmháil le d'oifig cánach, rachaidh na Coimisinéirí Ioncaim i dteagmháil le d'fhostóir agus gheobhaidh siad do P45 duit

source: If you have not been given your P45 and you think that your PRSI contributions have not been paid you should inform your local social welfare inspector by contacting your Intreo Centre or Social Welfare Branch Office or the Scope section of the Department of Social Protection
ga: Murar tugadh P45 duit agus go bhfuil tú den tuairim ná íocadh do ranníocaíochtaí ÁSPC, ba chóir duit insint don chigire leasa shóisialaigh áitiúil trí theagmháil a dhéanamh le d'Ionad Intreo ó d'Oifig Leasa Shóisialaigh Áitiúil nó le rannóg Scóipe na Roinn Coimirce Sóisialaí
